benchmarks.txt
OSX 10.9 2.3 GHz Intel Core i5 8 GB 1333 MHz DDR3

## JSON
ab -n 1500 -c 20 http://127.0.0.1:8001/

Server Software:
Server Hostname:        127.0.0.1
Server Port:            8001

Document Path:          /
Document Length:        5155 bytes

Concurrency Level:      20
Time taken for tests:   1.003 seconds
Complete requests:      1500
Failed requests:        0
Write errors:           0
Total transferred:      8946000 bytes
HTML transferred:       7732500 bytes
Requests per second:    1494.94 [#/sec] (mean)
Time per request:       13.378 [ms] (mean)
Time per request:       0.669 [ms] (mean, across all concurrent requests)
Transfer rate:          8706.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     2   13   2.8     14      22
Waiting:        2   13   2.8     14      22
Total:          3   13   2.8     14      22

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     15
  75%     15
  80%     15
  90%     16
  95%     16
  98%     17
  99%     18
 100%     22 (longest request)


## MessagePack
ab -n 1500 -c 20 http://127.0.0.1:8001/

Document Path:          /
Document Length:        5155 bytes

Concurrency Level:      20
Time taken for tests:   0.467 seconds
Complete requests:      1500
Failed requests:        0
Write errors:           0
Total transferred:      8946000 bytes
HTML transferred:       7732500 bytes
Requests per second:    3213.31 [#/sec] (mean)
Time per request:       6.224 [ms] (mean)
Time per request:       0.311 [ms] (mean, across all concurrent requests)
Transfer rate:          18715.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     1    6   1.5      6      13
Waiting:        1    6   1.5      6      13
Total:          2    6   1.5      6      13

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      7
  80%      7
  90%      8
  95%      8
  98%      9
  99%      9
 100%     13 (longest request)